# 1st Dataset

In [ ]:
import pandas as pd

In [68]:
x = {'Name': ['Rose','John', 'Jane', 'Mary'], 'ID': [19, 20, 35, 41], 'Department': ['Architect Group', 'Software Group', 'Design Team', 'Infrastructure'], 
      'Salary':[100000, 80000, 50000, 60000]}
x

{'Name': ['Rose', 'John', 'Jane', 'Mary'],
 'ID': [19, 20, 35, 41],
 'Department': ['Architect Group',
  'Software Group',
  'Design Team',
  'Infrastructure'],
 'Salary': [100000, 80000, 50000, 60000]}

In [69]:
#casting the dictionary to a DataFrame

df = pd.DataFrame(x)
df

   Name  ID       Department  Salary
0  Rose  19  Architect Group  100000
1  John  20   Software Group   80000
2  Jane  35      Design Team   50000
3  Mary  41   Infrastructure   60000

In [71]:
#select all columns
df.columns

Index(['Name', 'ID', 'Department', 'Salary'], dtype='object')

# Column Selection

In [60]:
#Retrieving one column
x = df[['ID']]
x

   ID
0  19
1  20
2  35
3  41

In [61]:
#Retrieving multiple columns

z = df[['Department','Salary']]
z

        Department  Salary
0  Architect Group  100000
1   Software Group   80000
2      Design Team   50000
3   Infrastructure   60000

In [22]:
# select a specific row/column
df.iloc[0, 0]

'Rose'

In [23]:
# Access the column using the name

df.loc[0, 'Name']

'Rose'

In [38]:
#allows column values to become the row index.
df2=df
df2=df2.set_index("Name")
df2

      ID       Department  Salary
Name
Rose  19  Architect Group  100000
John  20   Software Group   80000
Jane  35      Design Team   50000
Mary  41   Infrastructure   60000

In [40]:
#access the column using the name
df2.loc['Jane', 'Salary']

50000

# Slicing

In [41]:
df2.loc['Rose':'Mary', 'ID':'Department']

      ID       Department
Name
Rose  19  Architect Group
John  20   Software Group
Jane  35      Design Team
Mary  41   Infrastructure

In [24]:
# slicing multiple rows and columns using iloc

df.iloc[0:2, 0:3]

   Name  ID       Department
0  Rose  19  Architect Group
1  John  20   Software Group

In [43]:
#slicing using loc
df.loc[0:2,'Name':'Department']

   Name  ID       Department
0  Rose  19  Architect Group
1  John  20   Software Group
2  Jane  35      Design Team